[
  "obsidian-admonition",
  "table-editor-obsidian",
  "calendar",
  "obsidian-kanban",
  "obsidian-excalidraw-plugin",
  "obsidian-mind-map",
  "obsidian-git",
  "obsidian-outliner",
  "periodic-notes",
  "obsidian-tasks-plugin",
  "templater-obsidian"
]