[
  "obsidian-admonition",
  "table-editor-obsidian",
  "calendar",
  "obsidian-kanban",
  "obsidian-excalidraw-plugin",
  "obsidian-mind-map",
  "obsidian-git",
  "obsidian-outliner",
  "periodic-notes",
  "obsidian-tasks-plugin",
  "templater-obsidian",
  "obsidian-functionplot",
  "mermaid-tools",
  "obsidian-style-settings",
  "execute-code",
  "obsidian-carry-forward",
  "cmenu-plugin",
  "obsidian-daily-notes-opener",
  "obsidian-daily-notes-viewer",
  "obsidian-day-planner",
  "find-unlinked-files",
  "obsidian-folder-focus-mode",
  "ghost-fade-focus",
  "obsidian-hider",
  "highlightr-plugin",
  "obsidian-link-embed",
  "obsidian-living-graph",
  "longform",
  "media-extended",
  "obsidian-minimal-settings",
  "url-into-selection",
  "privacy-glasses",
  "obsidian-reading-time",
  "remember-cursor-position",
  "obsidian-remember-file-state",
  "obsidian-scroll-offset",
  "obsidian-smart-typography"
]